//- Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
//кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//    Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

//let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]

 //   if (friends.length >= 3){
 //       console.log('big')
 //   } else {
//      console.log('little')
//    }


//- Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//    Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.


// let arrNum = [1,2,3]
//if (arrNum[0]>arrNum[1]&& arrNum[0]>arrNum[2]){
//    console.log('0 biggest')
//}
//else if (arrNum[1]>arrNum[0] && arrNum[1]>arrNum[2]){
//    console.log('1 biggest')
//}
//else if (arrNum[2]>arrNum[0] && arrNum[2]>arrNum[1]) {
//    console.log('2 biggest')
//}
//else {
//    console.log('equal')
//}


//if (secondNumber < firstNumber && firstNumber < thirdNumber) {
    // Если это условие истинно, то код внутри этого блока выполнится.
 //   console.log(`${firstNumber} находится между ${secondNumber} и ${thirdNumber}`);
//} else {
    // Если условие ложно, то выполнится код внутри этого блока.
//    console.log(`${firstNumber} не находится между ${secondNumber} и ${thirdNumber}`);
//}


//- Перепишіть конструкцію if з використанням умовного оператора '?':
//let result;
//if (a + b < 4) {
//    result = 'Мало';
//} else {
//    result = 'Багато';
//}

//let result = a + b < 4 ? 'мало' : 'багато'

//- Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
//напишіть це тернарним оператором

//let x = 9


//let result = x > 0 ? 'позитивне' : x < 0 ? 'негативне' : 'нуль';

//let test = true;

//let result = test ? 'Вірно' : 'Неправильно';
//console.log(result);


//- Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
//Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: "Не знаєте? ECMAScript!"


 //   - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
//Користувач вводить номер квартири просто в змінні або через prompt('') .
//    Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.


//- Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО


//- Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//    Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//    Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН


//- За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//    числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .



